class Presets(object):
    HELP_TEXT = """
𝐀𝐣𝐮𝐝𝐚 𝐢𝐧𝐥𝐢𝐧𝐞 𝐘𝐨𝐮𝐭𝐮𝐛𝐞 𝘽𝙤𝙩:

𝐄𝐧𝐯𝐢𝐞 𝐮𝐦𝐚 𝐢𝐦𝐚𝐠𝐞𝐦, 𝐩𝐚𝐫𝐚 𝐬𝐞𝐫 𝐭𝐡𝐮𝐦𝐛 𝐩𝐞𝐫𝐦𝐚𝐦𝐞𝐧𝐭𝐞 𝐩𝐚𝐫𝐚 𝐬𝐞𝐮𝐬 𝐯í𝐝𝐞𝐨𝐬. 

𝑷𝒂𝒓𝒂 𝒅𝒆𝒕𝒆𝒍𝒂𝒓 𝒂 𝑻𝒉𝒖𝒎𝒃, é 𝒑𝒓𝒆𝒄𝒊𝒔𝒂𝒓 𝒖𝒔𝒂𝒓 𝒖𝒎𝒂 𝒐𝒑çã𝒐. 

𝑼𝒎𝒂 𝒅𝒊𝒄𝒂: 𝑵ã𝒐 𝒒𝒖𝒆𝒓𝒆𝒏𝒅𝒐 𝒑𝒐𝒓 𝒖𝒎𝒂 𝑻𝒉𝒖𝒎𝒃, 𝒊𝒓á 𝒈𝒆𝒓𝒂𝒓 𝒖𝒎𝒂 𝑻𝒉𝒖𝒎𝒃 𝒐𝒓𝒊𝒈𝒊𝒏𝒂𝒍 𝒅𝒐 𝒗í𝒅𝒆𝒐..

𝐒𝐞𝐚𝐫𝐜𝐡 𝐢𝐧𝐥𝐢𝐧𝐞 𝑭𝒂𝒄𝒊𝒍𝒊𝒕𝒂, 𝒐𝒖 𝒍𝒊𝒏𝒌 𝒅𝒐 𝒚𝒐𝒖𝒕𝒖𝒃𝒆 𝒑𝒂𝒓𝒂 𝒃𝒂𝒊𝒙𝒂𝒓 𝒗𝒊𝒅𝒆𝒐𝒔 𝒐𝒖 𝒎ú𝒔𝒊𝒄𝒂s. 

Entre <a href='https://t.me/GR4V3_S4D_CRAZZY'>🎚️𝑪𝒂𝒏𝒂𝒍</a> | ⚙️ Grupo <a href='https://t.me/blazer808_Stay'>𝑮𝒓𝒖𝒑𝒐</a>   
    """
    WELCOME_MSG = "𝑶𝒑𝒂 𝒂𝒅𝒆𝒎𝒊𝒓... {}\𝑬𝒖 𝒇𝒂ç𝒐 𝒅𝒐𝒘𝒏𝒍𝒐𝒂𝒅𝒔 𝒅𝒆 𝒗í𝒅𝒆𝒐𝒔 𝒆 𝒅𝒆 𝒎ú𝒔𝒊𝒄𝒂𝒔.\n𝐒𝐞𝐚𝐫𝐜𝐡 𝐈𝐧𝐥𝐢𝐧𝐞- 𝑺𝒆𝒍𝒆𝒄𝒊𝒐𝒏𝒆 𝒆 𝒃𝒂𝒊𝒙𝒆."
    OPTIONS_TXT = "𝑬𝒖 𝒇𝒂ç𝒐 𝒅𝒐𝒘𝒏𝒍𝒐𝒂𝒅𝒔 𝒅𝒆 𝒗í𝒅𝒆𝒐𝒔 𝒆 𝒅𝒆 𝒎ú𝒔𝒊𝒄𝒂𝒔.\n𝐒𝐞𝐚𝐫𝐜𝐡 𝐈𝐧𝐥𝐢𝐧𝐞- 𝑺𝒆𝒍𝒆𝒄𝒊𝒐𝒏𝒆 𝒆 𝒃𝒂𝒊𝒙𝒆."
    RESULTS_TXT = "🧐 𝙍𝙚𝙨𝙪𝙡𝙩𝙖𝙙𝙤𝙨:"
    NO_RESULTS = "❌ 𝑵ã𝒐 𝒕𝒆𝒎 𝒓𝒆𝒔𝒖𝒍𝒕𝒂𝒅𝒐𝒔:"
    DESCRIPTION = "𝐷𝑢𝑟𝑎çã𝑜: {} || {}"
    NOT_AUTH_TXT = "😳 ❌ 𝑽𝒐𝒄ê 𝒏ã𝒐 é 𝒂𝒖𝒕𝒐𝒓𝒊𝒛𝒂𝒅𝒐 😳 ❌"
    DEFAULT_TITLE = "😴 𝑻𝒓𝒂𝒔𝒉 𝑮𝒂𝒏𝒈 𝑰𝒏𝒍𝒊𝒏𝒆 😴"
    DEFAULT_THUMB_URL = "https://image.flaticon.com/icons/png/512/25/25231.png"
    DEFAULT_LINK = "https://t.me/xPV_D4_M34_S4Y0R1_D3M0N_CR4ZZYx"
    DEFAULT_DESCRIPTION = "𝐋𝐢𝐧𝐤: 𝑪𝒓𝒊𝒂𝒅𝒐𝒓 | 𝙋𝙖𝙚"
    DEV_TITLE = "𝐼𝑛𝑓𝑜𝑟𝑚𝑎çõ𝑒𝑠 𝑑𝑒 𝑑𝑒𝑠𝑒𝑛𝑣𝑜𝑙𝑣𝑖𝑚𝑒𝑛𝑡𝑜"
    DEV_THUMB_URL = "https://freepikpsd.com/media/2019/10/software-developer-icon-png-2-Transparent-Images.png"
    DEV_LINK = "https://t.me/space4renjith"
    DEV_DESCRIPTION = "𝐍𝐚𝐦𝐞: 𝑪𝒓𝒊𝒂𝒅𝒐𝒓 | 𝐓𝐞𝐥𝐞𝐠𝐫𝐚𝐦"
    SHARE_BUTTON_TEXT = "Olá..  👋\n𝐂𝐡𝐞𝐜𝐤 : @{username}\𝗣𝗮𝗿𝗮 𝗽𝗲𝘀𝗾𝘂𝗶𝘀𝗮𝗿 𝗲 𝗯𝗮𝗶𝘅𝗮𝗿 𝘃í𝗱𝗲𝗼𝘀"
    SAVED_THUMB = "<b>✅ Thumbnail Salvado Com Successo</b>\n<code>O file uso para a próxima, YouTube " \
                  "downloads until you clear it !</code> "
    WAIT_MESSAGE = "𝑃𝑜𝑟 𝑓𝑎𝑣𝑜𝑟, 𝑎𝑔𝑢𝑎𝑟𝑑𝑒.. 𝟒 𝐚 segundos!"
    THUMB_CAPTION = "<code>A imagem é correta para thumbnail, Tap </code><b> DEL THUMB </b><code> if you wish to " \
                    "clear it !</code> "
    NO_THUMB = "𝑷𝒆𝒈𝒖𝒆 𝒂𝒍𝒈𝒖𝒎𝒂 𝒊𝒎𝒂𝒈𝒆𝒎 𝒆 𝒖𝒑𝒍𝒐𝒂𝒅 𝒑𝒂𝒓𝒂 𝒗í𝒅𝒆𝒐𝒔!"
    DEL_THUMB_CNF = "𝐓𝐡𝐮𝐦𝐛𝐧𝐚𝐢𝐥 𝐴𝑝𝑎𝑔𝑎𝑑𝑜 𝑐𝑜𝑚 𝑠𝑢𝑐𝑒𝑠𝑠𝑜 🧐👍✅"
    LINK_ERROR = "𝐒𝐨𝐦𝐞 𝐞𝐫𝐫𝐨𝐫𝐬 𝐨𝐜𝐜𝐮𝐫𝐫𝐞𝐝 𝐰𝐡𝐢𝐥𝐞 𝐭𝐡𝐞 𝐩𝐫𝐨𝐜𝐞𝐬𝐬 !\n𝐏𝐥𝐞𝐚𝐬𝐞 𝐭𝐫𝐲 𝐚𝐠𝐚𝐢𝐧 𝐥𝐚𝐭𝐞𝐫.."
    #
    #
    #
    NO_VOID_FORMAT_FOUND = "<code>{}</code>"
    FINISHED_PROGRESS_STR = "◼️"
    UN_FINISHED_PROGRESS_STR = "◻️"
    CHECKING_LINK = "⏳ Pᴏʀ ғᴀᴠᴏʀ, ᴇsᴘᴇʀᴇ... ⏳"
    DOWNLOAD_START = "ᵇᵃⁱˣᵃⁿᵈᵒ... ᵃᵍᵒʳᵃ ᵃᵍᵘᵃʳᵈᵉ ᵖᵒʳʳᵃ !"
    UPLOAD_START = "𝖢𝖺𝗋𝗋𝖾𝗀𝖺𝗇𝖽𝗈 𝖾 𝖾𝗇𝗏𝗂𝖺𝗇𝖽𝗈 𝗉𝖺𝗋𝖺 𝗏𝗈𝖼ê..."
    NOT_DOWNLOADABLE = "𝐄𝐬𝐬𝐞 𝐔𝐫𝐥 𝐧𝐞𝐦 𝐛𝐚𝐢𝐱𝐚 𝐧𝐞𝐦 𝐚 𝐩𝐚𝐮, 𝐟𝐞𝐥𝐚 🧐!"
    CANCEL_PROCESS = "<b>𝑃𝑟𝑜𝑐𝑒𝑠𝑠𝑜 𝑐𝑎𝑛𝑐𝑒𝑙𝑎𝑑𝑜 𝑐𝑜𝑚 𝑠𝑢𝑐𝑒𝑠𝑠𝑜</b>  ✅"
    SEND_TEXT = "<b>𝑪𝒂𝒓𝒓𝒆𝒈𝒂𝒏𝒅𝒐...</b>\n<i>This message will automatically disappear when the broadcasting is finished</i> "
    REPLY_ERROR = "<i>Use this command as a replay to any telegram message with out any spaces.</i>"
    USERS_LIST = "<b>Total: {}</b>\n\nIncritos - {}\nBloqueados / Apagados - {}"
    WAIT_MSG = "<b>𝑪𝒂𝒓𝒓𝒆𝒈𝒂𝒏𝒅𝒐...</b>\n<i>This will take some time...</i>"
    PROMPT_THUMB = "<b>Do you want to set this image as a thumbnail?</b>"
    FORMAT_SELECTION = """
<b>Title -</b> {}
<b>Channel -</b> <a href={}>{}</a>
<b>Uploaded On -</b> {}
<b>Views -</b> {}  |  <b>Rating:</b> {}

<b>Select the desired format:</b>
    """
    SET_CUSTOM_USERNAME_PASSWORD = """If you want to download premium videos, provide in the following format:
URL | newfilename | username | password"""
    CUSTOM_CAPTION_UL_FILE = "\xad \xad\n<code>{}</code>\n\n<b>By- </b><b><a href='https://t.me/xPV_D4_M34_S4Y0R1_D3M0N_CR4ZZYx'>𝑪𝒓𝒊𝒂𝒅𝒐𝒓</a></b>"
    RCHD_TG_API_LIMIT = "Detected File Size: {}\nSorry. But, I cannot upload files " \
                        "greater than 1.95GB due to Telegram API limitations."
    AD_STRING_TO_REPLACE = "please report this issue on https://yt-dl.org/bug . Make sure you are using the " \
                           "latest version; see  https://yt-dl.org/update  on how to update. Be sure to call " \
                           "youtube-dl with the --verbose flag and include its complete output."
